Documents/ЛБ_ИзменениеСтатусаНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИзменениеСтатусаНакладной</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОтгруженныеНакладные</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВПути</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыОбъектовЗалогаВНакладной</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыНакладнойНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийИзменениеСтатусаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаОтменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОборотыПоОперациямЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОборотыПоОперациямЗайма</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Comment>Залоговый билет</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЛБ_ИзменениеСтатусаНакладной/Ext/ObjectModule.bsl
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		СписокНеЗаполненныхРеквизитов = "";
		КолРеквизитов = 0;    
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НакладнаяНаОтгрузку) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Накладная на отгрузку"; 
			КолРеквизитов = КолРеквизитов + 1;   
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидОперации) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Вид операции"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;
       		
		Если НЕ КолРеквизитов = 0 Тогда   
			ТекстСообщения = ?(КолРеквизитов = 1, "Не заполнен реквизит документа ", "Не заполнены реквизиты документа ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + СписокНеЗаполненныхРеквизитов);
			Отказ = Истина;
		КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	СписокСтатусовНакладных = Новый СписокЗначений;
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Факт); 
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта);
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта);
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена);

	ТекущийСтатус = ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойНаОтгрузку(Дата-1, НакладнаяНаОтгрузку);	
	Строкасписка = СписокСтатусовНакладных.НайтиПоЗначению(ТекущийСтатус);
	Инд = Строкасписка.ПолучитьИдентификатор(); 
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
	ТаблицаСтатусовОЗВНакладной = Запрос.Выполнить().Выгрузить();
	
	НовыйСтатус = неопределено;
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийИзменениеСтатусаНакладнойНаОтгрузку.СменаСтатуса Тогда 
		СтрокаПоиска = СписокСтатусовНакладных.НайтиПоИдентификатору(Инд+1);
		Если НЕ СтрокаПоиска = неопределено тогда 
			НовыйСтатус = СтрокаПоиска.Значение; 
		КонецЕсли;	
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийИзменениеСтатусаНакладнойНаОтгрузку.ОтменаСтатуса Тогда
		СтрокаПоиска = СписокСтатусовНакладных.НайтиПоИдентификатору(Инд-1);
		Если НЕ СтрокаПоиска = неопределено тогда 
			НовыйСтатус = СтрокаПоиска.Значение; 
		КонецЕсли;	
	КонецЕсли;	   
	
    Если НЕ НовыйСтатус = неопределено Тогда
		Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;

		ЗапросН = Новый Запрос; 
		ЗапросН.УстановитьПараметр("Дата", Дата-1); 
		ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", ЭтотОбъект.НакладнаяНаОтгрузку);
		ЗапросН.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СкладПолучатель КАК СкладПолучатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Пустой КАК Пустой
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
	    ВыборкаН = ЗапросН.Выполнить().Выбрать();
		Если ВыборкаН.Следующий() Тогда

			ДвижениеН = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
			ДвижениеН.Период = Дата;
			ДвижениеН.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку; 
			ДвижениеН.НомерНакладной = ВыборкаН.НомерНакладной;
			ДвижениеН.ДатаНакладной = ВыборкаН.ДатаНакладной;
			ДвижениеН.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
			ДвижениеН.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;  
			ДвижениеН.Пустой = ВыборкаН.Пустой;
			ДвижениеН.СтатусНакладной = НовыйСтатус; 
			ДвижениеН.Инкассатор = ЭтотОбъект.Инкассатор;
			ДвижениеН.Получатель = ЭтотОбъект.Получатель; 
			ДвижениеН.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
			ДвижениеН.ОтветственныйПользователь = ЭтотОбъект.Ответственный; 
			ДвижениеН.ОтветственныйСотрудник = ЭтотОбъект.ОтветственныйСотрудник;
		КонецЕсли;	
		
		Если НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Факт Тогда
		    НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт;
		ИначеЕсли НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта Тогда
		    НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта;	
		ИначеЕсли НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта Тогда
		    НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта;
		ИначеЕсли НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена Тогда
		    НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено;	
	    КонецЕсли;
		
		ТаблицаЗБ = ЭтотОбъект.НакладнаяНаОтгрузку.Залоги.Выгрузить();  
		ТаблицаЗБ.Свернуть("ЗалоговыйБилет"); 
		СписокЗБ = новый СписокЗначений;
		Для каждого СтрЗБ Из ТаблицаЗБ Цикл                
			Отбор = Новый Структура;
			Отбор.Вставить("ЗалоговыйБилет", СтрЗБ.ЗалоговыйБилет);
			Строки = ТаблицаСтатусовОЗВНакладной.НайтиСтроки(Отбор); 
			Если НЕ Строки.Количество() = 0 Тогда
				Если Строки.Получить(0).статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда  
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СписокЗБ.Добавить(СтрЗБ.ЗалоговыйБилет);
        Конеццикла;
		
		ПроводитьПоОборотам = Истина;  
		Если НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта ИЛИ
			 НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта Тогда 
			ПроводитьПоОборотам =ложь; 
		ИначеЕсли НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт Тогда    
			ЗапросН.Текст = "ВЫБРАТЬ
			                |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной
			                |ИЗ
			                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
			                |ГДЕ
			                |	ЛБ_СтатусыНакладнойНаОтгрузку.Период <= &Дата
			                |	И ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
			                |	И ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Факт)"; 
			ВыборкаН =ЗапросН.Выполнить().Выбрать();
			Если ВыборкаН.Следующий() Тогда
				ПроводитьПоОборотам =ложь;
            КонецЕсли;
        КонецЕсли;
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина; 	
		Если ПроводитьПоОборотам Тогда
			Для каждого Эл Из СписокЗБ Цикл                
				Отбор = Новый Структура;
				Отбор.Вставить("ЗалоговыйБилет", Эл.Значение);
				Строки = ТаблицаЗБ.НайтиСтроки(Отбор);  
				СтрЗБ = Строки.Получить(0);
			    Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
				Движение.Период = Дата;                        
				Движение.ВидОперации = "Изменение статуса накладной";
				Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;
			    Движение.Залогодатель = СтрЗБ.ЗалоговыйБилет.Залогодатель;
			    Движение.Организация = ЭтотОбъект.НакладнаяНаОтгрузку.Организация;
				//Если НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена Тогда 
				//	Движение.Ломбард = ЭтотОбъект.Получатель;
				//Иначе	
				    Движение.Ломбард = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард;  
				//КонецЕсли;	
				Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку; 
			КонецЦикла;	 
		КонецЕсли;	

	 	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;
		Для каждого Выборка Из ТаблицаСтатусовОЗВНакладной Цикл  			
			Если Выборка.статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда 
				//ДвижениеН.КоличествоИзделий = ЭтотОбъект.НакладнаяНаОтгрузку.Залоги.Итог("Количество");
				//ДвижениеН.ВесИзделий = ЭтотОбъект.НакладнаяНаОтгрузку.Залоги.Итог("Вес");
				//ДвижениеН.СуммаОценки = ЭтотОбъект.НакладнаяНаОтгрузку.Залоги.Итог("СуммаОценки");
				Продолжить;
			КонецЕсли;	
			Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Выборка.ОбъектЗалога;
	       	Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
			Движение.Статус = НовыйСтаусОбъектаЗалогаВНакладной;
		КонецЦикла;   
		
		Если НовыйСтатус = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена Тогда
			Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(НакладнаяНаОтгрузку.Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги); 
			
			ЗапросОЗ = Новый Запрос;  
			ЗапросОЗ.УстановитьПараметр("Дата", Дата);
			ЗапросОЗ.Текст = "ВЫБРАТЬ
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты
			                 |ИЗ
			                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			                 |			&Дата,
			                 |			ЗалоговыйБилет = &ЗалоговыйБилет
			                 |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
					
			Запрос.Текст ="ВЫБРАТЬ
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток) КАК Вес,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток) КАК СуммаОценки
			              |ИЗ
			              |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
			              |
			              |СГРУППИРОВАТЬ ПО
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина; 
			Движения.ЛБ_ОбъектыЗалога.Записывать = Истина; 
			Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина;  
			Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;  
			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			
			КоличествоСписать = 0;
			Для каждого Стр Из ТаблицаЗапроса Цикл 
				Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
			    Движение.Организация = ЭтотОбъект.НакладнаяНаОтгрузку.Организация; 
				Движение.Ломбард = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард;   
				Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;  
				Движение.Вес = Стр.Вес;
				Движение.СуммаОценки = Стр.СуммаОценки;    
				
				//спишем объекты залога  из накладной со склада                                                                                                     								 
				ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Дата-1, НакладнаяНаОтгрузку.Организация, НакладнаяНаОтгрузку.Ломбард, Склад); 
				  
			    Отбор = новый структура;
				Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
				Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
				СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
				Если СтрокиОст.Количество() = 0 Тогда 
					ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + СокрЛП(Стр.ОбъектЗалога.Артикул) + " не найдено на складе " + СокрЛП(Склад));
				Иначе        
					СтрОст = СтрокиОст.Получить(0); 
					КоличествоСписать = КоличествоСписать + 1;
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = ЭтотОбъект.НакладнаяНаОтгрузку.Организация;
					Движение.Ломбард = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард; 
					Движение.Склад = Склад;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = СтрОст.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки; 
					
					Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = ЭтотОбъект.НакладнаяНаОтгрузку.Организация;
					Движение.Отправитель = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард; 
					Движение.СкладОтправитель = Склад;
					Движение.Получатель = ЭтотОбъект.Получатель; 
					Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = СтрОст.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;  
					Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку; 
					Движение.Инкассатор = ЭтотОбъект.Инкассатор;	
					
					ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет);  
					ЗапросОЗ.УстановитьПараметр("ОбъектЗалога", Стр.ОбъектЗалога);
				    ВыборкаОЗ = ЗапросОЗ.Выполнить().Выбрать();                 
					Если ВыборкаОЗ.Следующий() Тогда  
					    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить(); 
				        Движение.Период = Дата;  
					    Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути;
					    Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					    Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					    Движение.СуммаДолгаЗайма = ВыборкаОЗ.СуммаДолгаЗайма;
					    Движение.СуммаЗайма = ВыборкаОЗ.СуммаЗайма;
					    Движение.СуммаОплаты = ВыборкаОЗ.СуммаОплаты;
					    Движение.СуммаОценки = ВыборкаОЗ.СуммаОценки;
					    Движение.СуммаОценкиНачальная = ВыборкаОЗ.СуммаОценкиНачальная;   
					    Движение.Комментарий = "Отправитель: " + СокрЛП(ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард) + ", склад отгрузки " + СокрЛП(Склад) + ", Получатель " +
				                  СокрЛП(ЭтотОбъект.Получатель) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель);								
				 	КонецЕсли; 
				КонецЕсли;
			КонецЦикла;	  
			
			Если НЕ ЭтотОбъект.ОтгрузкаОтменена Тогда
				Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
				Движение.Период = Дата;
				Движение.Организация = ЭтотОбъект.НакладнаяНаОтгрузку.Организация;
				Движение.ПодразделениеОсновное = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард;
				Движение.СкладОсновной = Склад;
				Движение.ПодразделениеОтправитель = ЭтотОбъект.НакладнаяНаОтгрузку.Ломбард;
				Движение.СкладОтправитель = Склад;   
				Движение.ПодразделениеПолучатель = ЭтотОбъект.Получатель;
				Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
				Движение.Количество = КоличествоСписать;
				Движение.Инкассатор = ЭтотОбъект.Инкассатор;  
				Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку; 
				Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;
				Движение.ВидОперации = "Отгрузка накладной";  
			КонецЕсли;	

			
			Движения.ЛБ_ОтгруженныеНакладные.Записывать = Истина;
			Движение = Движения.ЛБ_ОтгруженныеНакладные.Добавить();
			Движение.Период = Дата;
		    Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
			Движение.КоличествоИзделий = ТаблицаЗапроса.Итог("Количество");  
			Движение.ВесИзделий = ТаблицаЗапроса.Итог("Вес");
			Движение.СуммаОценки = ТаблицаЗапроса.Итог("СуммаОценки");			
			
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина; 
			Запрос.УстановитьПараметр("ЗБ", списокЗБ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОплатыБезПродления КАК ДатаОплатыБезПродления
			               |ИЗ
			               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				 Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить(); 
				 Движение.Период = Дата;       
				 Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен;
				 Движение.Залогодатель = Выборка.Залогодатель;
			     Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			     Движение.НомерЗалоговогоБилета = Выборка.НомерЗалоговогоБилета;
			     Движение.СхемаКредитования = Выборка.ЗалоговыйБилет.СхемаКредитования;
			     Движение.ПричинаПрименения = Выборка.ПричинаПрименения;			     
			     Движение.СуммаЗайма = Выборка.СуммаЗайма;
			     Движение.ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
			     Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;
			     Движение.ДатаВыкупа = Выборка.ДатаВыкупа;
			     Движение.ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок;
			     Движение.СуммаПроцентовДень = Выборка.СуммаПроцентовДень;
			     Движение.СуммаПроцентовСрок = Выборка.СуммаПроцентовСрок;
			     Движение.ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
			     Движение.ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
			     Движение.ДатаОстановкиНачислений = Выборка.ДатаОстановкиНачислений;
			     Движение.ДатаОплатыБезПродления = Выборка.ДатаОплатыБезПродления;
			 Конеццикла;	  
			 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
